-----------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/data_preprocessing.log
  log type:  text
 opened on:  10 Mar 2020, 11:38:15

. do "/var/folders/s9/1_58_r7d14q02tq0nct3crv00000gn/T//SD21311.000000"

. ***** Assignment II Survival analysis*****
. 
. ***** Data Preprocessing *****
. 
. * Enrollment Data
. 
. *** Change date format ***
. 
. use "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/enrollment data for KT project.dta"
(recipient form)

. d

Contains data from /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/enrollment data for KT project.dta
  obs:           510                          recipient form
 vars:            53                          17 Feb 2020 09:19
-----------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------
no              int     %3.0f                 ID
subjid          long    %7.0f                 Subject ID
sexr            byte    %10.0f     epd1       Sex of recipient
datebirt        long    %d                    Date of birth
ager            int     %3.0f                 Age of recipient
bloodgrr        byte    %10.0f     epd2       Blood Gr. of recipient
pretrans        byte    %10.0f     epd3       Pre-transplantation
datepret        long    %d                    date of pre-transplantation
hbs             byte    %11.0f     epd4       HBS Ag of recipient
athbsr          byte    %11.0f     epd4       Anti HBS of recipient
anthcv          byte    %11.0f     epd4       Anti HCV of recipient
iggr            byte    %11.0f     epd4       IgG of recipient
igmr            byte    %11.0f     epd4       IgM of recipient
hiv             byte    %11.0f     epd4       Anti HIV of recipient
caesrd          byte    %32.0f     epd5       Cause of ESRD
mode            byte    %14.0f     epd6       mode of dialysis
durdialy        double  %3.0f                 Duration of dialysis
dmr             byte    %10.0f     epd3       DM at enrollment
autcell         byte    %11.0f     epd4       Autoantibody T cell
tyatcell        byte    %10.0f     epd7       specify type of auto T cell
aubcell         byte    %11.0f     epd4       Autoantibody B cell
tyabcell        byte    %10.0f     epd7       specify type of auto B cell
pra             double  %3.0f                 PRA - last
hlamatch        byte    %16.0f     epd8       Type of HLA matching
nomiss          byte    %2.0f                 Number of mismatch
totalmat        byte    %1.0f                 Total number of mismatch
hlamiss         byte    %1.0f                 Number of HLA-A mismatch
hlbmiss         byte    %1.0f                 Number of HLA-B mismatch
hldrmiss        byte    %1.0f                 Number of HLA-DR mismatch
height          double  %6.2f                 Height
weight          double  %6.2f                 Weight
year            float   %9.0g                 
dna             byte    %10.0f     epd3       DNA
sero            byte    %10.0f     epd3       Serology
dateop          long    %d                    Date of operation
typedonor       byte    %1.0f      epd1       type of donor
relate          byte    %2.0f      epd2       Relationship between donor and recipient
cit             double  %5.2f                 Cold ischemic time
wit             byte    %2.0f                 Warm ischemic time
induce          byte    %1.0f      epd3       Induction
spind           byte    %1.0f      epd4       if yes, specify
dgf             byte    %1.0f      epd3       Delayed graft function
bestcr          double  %5.2f                 Best Cr
datebcr         long    %d                    date of Best Cr
discr           double  %5.2f                 Discharge Cr
datedis         long    %d                    date of discharge
imcomp          byte    %1.0f      epd3       Immediate complication
ar              byte    %1.0f      epd3       1. Acute rejection
datear          long    %d                    date of Acute rejection
uti             byte    %1.0f      epd3       2. UTI
dateuti         long    %d                    date of UTI
cit1            double  %5.2f                 Cold ischemic time @
wit1            byte    %2.0f                 Warm ischemic time @
-----------------------------------------------------------------------------------------------------------------------------
Sorted by: subjid

. * 510 subjects
. 
. xtile agegr = ager, nquantiles(3)

. label var agegr "Age Groups"

. * sum ager if agegr==1
. * sum ager if agegr==2
. * sum ager if agegr==3
. label define agegr 1 "Age 10 to 36" 2 "Age 37 to 47" 3 "Age 48 to 70"

. label values agegr agegr

. 
. * Date of birth
. list datebirt in 1/10

     +-----------+
     |  datebirt |
     |-----------|
  1. | 20apr1943 |
  2. | 01jul1931 |
  3. | 06apr1946 |
  4. | 14sep1955 |
  5. | 18may1961 |
     |-----------|
  6. | 25jun1974 |
  7. | 15jan1954 |
  8. | 01jan2498 |
  9. | 26feb1949 |
 10. | 01jan1952 |
     +-----------+

. gen yearbirt1=year(datebirt)
(1 missing value generated)

. tab yearbirt1

  yearbirt1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1931 |          1        0.20        0.20
       1934 |          1        0.20        0.39
       1935 |          1        0.20        0.59
       1936 |          3        0.59        1.18
       1937 |          3        0.59        1.77
       1938 |          2        0.39        2.16
       1939 |          5        0.98        3.14
       1940 |          8        1.57        4.72
       1941 |          6        1.18        5.89
       1942 |          7        1.38        7.27
       1943 |          7        1.38        8.64
       1944 |          5        0.98        9.63
       1945 |          5        0.98       10.61
       1946 |          4        0.79       11.39
       1947 |          9        1.77       13.16
       1948 |          5        0.98       14.15
       1949 |          7        1.38       15.52
       1950 |         10        1.96       17.49
       1951 |         11        2.16       19.65
       1952 |         12        2.36       22.00
       1953 |         10        1.96       23.97
       1954 |         11        2.16       26.13
       1955 |         17        3.34       29.47
       1956 |          9        1.77       31.24
       1957 |         13        2.55       33.79
       1958 |         10        1.96       35.76
       1959 |          6        1.18       36.94
       1960 |         11        2.16       39.10
       1961 |          9        1.77       40.86
       1962 |         19        3.73       44.60
       1963 |          7        1.38       45.97
       1964 |         13        2.55       48.53
       1965 |          9        1.77       50.29
       1966 |         14        2.75       53.05
       1967 |         12        2.36       55.40
       1968 |         14        2.75       58.15
       1969 |          9        1.77       59.92
       1970 |          4        0.79       60.71
       1971 |          5        0.98       61.69
       1972 |          3        0.59       62.28
       1973 |          7        1.38       63.65
       1974 |          4        0.79       64.44
       1975 |          4        0.79       65.23
       1976 |          3        0.59       65.82
       1977 |          3        0.59       66.40
       1978 |          3        0.59       66.99
       1979 |          3        0.59       67.58
       1980 |          5        0.98       68.57
       1981 |          1        0.20       68.76
       1982 |          1        0.20       68.96
       1985 |          1        0.20       69.16
       1988 |          1        0.20       69.35
       1997 |          1        0.20       69.55
       2478 |          2        0.39       69.94
       2481 |          1        0.20       70.14
       2482 |          1        0.20       70.33
       2484 |          1        0.20       70.53
       2485 |          1        0.20       70.73
       2486 |          2        0.39       71.12
       2487 |          3        0.59       71.71
       2488 |          3        0.59       72.30
       2489 |          4        0.79       73.08
       2490 |          3        0.59       73.67
       2491 |          3        0.59       74.26
       2492 |          2        0.39       74.66
       2493 |          5        0.98       75.64
       2494 |          4        0.79       76.42
       2495 |          4        0.79       77.21
       2496 |          4        0.79       78.00
       2497 |          2        0.39       78.39
       2498 |          4        0.79       79.17
       2499 |          5        0.98       80.16
       2500 |          3        0.59       80.75
       2501 |          9        1.77       82.51
       2502 |          4        0.79       83.30
       2503 |          4        0.79       84.09
       2504 |          5        0.98       85.07
       2505 |          1        0.20       85.27
       2506 |          5        0.98       86.25
       2507 |          6        1.18       87.43
       2508 |          2        0.39       87.82
       2509 |          5        0.98       88.80
       2510 |          7        1.38       90.18
       2511 |          5        0.98       91.16
       2512 |          6        1.18       92.34
       2513 |          2        0.39       92.73
       2514 |          7        1.38       94.11
       2515 |          4        0.79       94.89
       2516 |          2        0.39       95.28
       2517 |          2        0.39       95.68
       2518 |          5        0.98       96.66
       2519 |          2        0.39       97.05
       2520 |          1        0.20       97.25
       2521 |          1        0.20       97.45
       2522 |          3        0.59       98.04
       2523 |          1        0.20       98.23
       2526 |          1        0.20       98.43
       2527 |          1        0.20       98.62
       2532 |          4        0.79       99.41
       2534 |          1        0.20       99.61
       2538 |          1        0.20       99.80
       2539 |          1        0.20      100.00
------------+-----------------------------------
      Total |        509      100.00

. * 1931 to 1997 in Gregorian
. * 2478 to 2539 in Buddhist
. * will convert all to Gregorian
. replace yearbirt1= yearbirt1-543 if inrange(yearbirt1,2030,.)
(155 real changes made)

. tab yearbirt1

  yearbirt1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1931 |          1        0.20        0.20
       1934 |          1        0.20        0.39
       1935 |          3        0.59        0.98
       1936 |          3        0.59        1.57
       1937 |          3        0.59        2.16
       1938 |          3        0.59        2.75
       1939 |          6        1.18        3.93
       1940 |          8        1.57        5.50
       1941 |          7        1.38        6.88
       1942 |          8        1.57        8.45
       1943 |          9        1.77       10.22
       1944 |          8        1.57       11.79
       1945 |          8        1.57       13.36
       1946 |          8        1.57       14.93
       1947 |         12        2.36       17.29
       1948 |          8        1.57       18.86
       1949 |          9        1.77       20.63
       1950 |         15        2.95       23.58
       1951 |         15        2.95       26.52
       1952 |         16        3.14       29.67
       1953 |         14        2.75       32.42
       1954 |         13        2.55       34.97
       1955 |         21        4.13       39.10
       1956 |         14        2.75       41.85
       1957 |         16        3.14       44.99
       1958 |         19        3.73       48.72
       1959 |         10        1.96       50.69
       1960 |         15        2.95       53.63
       1961 |         14        2.75       56.39
       1962 |         20        3.93       60.31
       1963 |         12        2.36       62.67
       1964 |         19        3.73       66.40
       1965 |         11        2.16       68.57
       1966 |         19        3.73       72.30
       1967 |         19        3.73       76.03
       1968 |         19        3.73       79.76
       1969 |         15        2.95       82.71
       1970 |          6        1.18       83.89
       1971 |         12        2.36       86.25
       1972 |          7        1.38       87.62
       1973 |          9        1.77       89.39
       1974 |          6        1.18       90.57
       1975 |          9        1.77       92.34
       1976 |          5        0.98       93.32
       1977 |          4        0.79       94.11
       1978 |          4        0.79       94.89
       1979 |          6        1.18       96.07
       1980 |          6        1.18       97.25
       1981 |          1        0.20       97.45
       1982 |          1        0.20       97.64
       1983 |          1        0.20       97.84
       1984 |          1        0.20       98.04
       1985 |          1        0.20       98.23
       1988 |          1        0.20       98.43
       1989 |          4        0.79       99.21
       1991 |          1        0.20       99.41
       1995 |          1        0.20       99.61
       1996 |          1        0.20       99.80
       1997 |          1        0.20      100.00
------------+-----------------------------------
      Total |        509      100.00

. gen daybirt1=day(datebirt)
(1 missing value generated)

. tab daybirt1

   daybirt1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         78       15.32       15.32
          2 |         24        4.72       20.04
          3 |         13        2.55       22.59
          4 |         15        2.95       25.54
          5 |         18        3.54       29.08
          6 |         19        3.73       32.81
          7 |         17        3.34       36.15
          8 |         14        2.75       38.90
          9 |         13        2.55       41.45
         10 |         22        4.32       45.78
         11 |         16        3.14       48.92
         12 |         14        2.75       51.67
         13 |         13        2.55       54.22
         14 |         23        4.52       58.74
         15 |         15        2.95       61.69
         16 |         17        3.34       65.03
         17 |         18        3.54       68.57
         18 |         16        3.14       71.71
         19 |          6        1.18       72.89
         20 |         17        3.34       76.23
         21 |          6        1.18       77.41
         22 |         11        2.16       79.57
         23 |         15        2.95       82.51
         24 |         11        2.16       84.68
         25 |          9        1.77       86.44
         26 |         11        2.16       88.61
         27 |         15        2.95       91.55
         28 |         11        2.16       93.71
         29 |         14        2.75       96.46
         30 |         10        1.96       98.43
         31 |          8        1.57      100.00
------------+-----------------------------------
      Total |        509      100.00

. gen monthbirt1=month(datebirt)
(1 missing value generated)

. tab monthbirt1

 monthbirt1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         94       18.47       18.47
          2 |         30        5.89       24.36
          3 |         32        6.29       30.65
          4 |         47        9.23       39.88
          5 |         41        8.06       47.94
          6 |         42        8.25       56.19
          7 |         31        6.09       62.28
          8 |         33        6.48       68.76
          9 |         45        8.84       77.60
         10 |         37        7.27       84.87
         11 |         38        7.47       92.34
         12 |         39        7.66      100.00
------------+-----------------------------------
      Total |        509      100.00

. list subjid datebirt daybirt1 monthbirt1 yearbirt1 in 1/10

     +-----------------------------------------------------+
     | subjid    datebirt   daybirt1   monthb~1   yearbi~1 |
     |-----------------------------------------------------|
  1. |  14581   20apr1943         20          4       1943 |
  2. | 463800   01jul1931          1          7       1931 |
  3. | 495428   06apr1946          6          4       1946 |
  4. | 624966   14sep1955         14          9       1955 |
  5. | 649440   18may1961         18          5       1961 |
     |-----------------------------------------------------|
  6. | 651587   25jun1974         25          6       1974 |
  7. | 792656   15jan1954         15          1       1954 |
  8. | 794318   01jan2498          1          1       1955 |
  9. | 888840   26feb1949         26          2       1949 |
 10. | 906470   01jan1952          1          1       1952 |
     +-----------------------------------------------------+

. gen datebirt1=mdy(monthbirt1,daybirt1,yearbirt1)
(1 missing value generated)

. format datebirt1 %d

. list subjid datebirt daybirt1 monthbirt1 yearbirt1 datebirt1 in 1/10

     +-----------------------------------------------------------------+
     | subjid    datebirt   daybirt1   monthb~1   yearbi~1   datebirt1 |
     |-----------------------------------------------------------------|
  1. |  14581   20apr1943         20          4       1943   20apr1943 |
  2. | 463800   01jul1931          1          7       1931   01jul1931 |
  3. | 495428   06apr1946          6          4       1946   06apr1946 |
  4. | 624966   14sep1955         14          9       1955   14sep1955 |
  5. | 649440   18may1961         18          5       1961   18may1961 |
     |-----------------------------------------------------------------|
  6. | 651587   25jun1974         25          6       1974   25jun1974 |
  7. | 792656   15jan1954         15          1       1954   15jan1954 |
  8. | 794318   01jan2498          1          1       1955   01jan1955 |
  9. | 888840   26feb1949         26          2       1949   26feb1949 |
 10. | 906470   01jan1952          1          1       1952   01jan1952 |
     +-----------------------------------------------------------------+

. drop daybirt1 monthbirt1 yearbirt1 

. label var datebirt1 "Date of Birth"

. 
. * Date of Pre-transplantation
. list datepret in 1/10

     +-----------+
     |  datepret |
     |-----------|
  1. |         . |
  2. |         . |
  3. |         . |
  4. |         . |
  5. |         . |
     |-----------|
  6. |         . |
  7. |         . |
  8. | 06jun2543 |
  9. |         . |
 10. |         . |
     +-----------+

. gen yearpret1=year(datepret)
(491 missing values generated)

. tab yearpret1

  yearpret1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1987 |          1        5.26        5.26
       1992 |          1        5.26       10.53
       1996 |          2       10.53       21.05
       2531 |          1        5.26       26.32
       2533 |          1        5.26       31.58
       2535 |          1        5.26       36.84
       2536 |          3       15.79       52.63
       2538 |          2       10.53       63.16
       2539 |          3       15.79       78.95
       2541 |          1        5.26       84.21
       2543 |          1        5.26       89.47
       2546 |          1        5.26       94.74
       2547 |          1        5.26      100.00
------------+-----------------------------------
      Total |         19      100.00

. * 1987 to 1996 in Gregorian
. * 2531 to 2547 in Buddhist
. * will convert all to Gregorian
. replace yearpret1= yearpret1-543 if inrange(yearpret1,2030,.)
(15 real changes made)

. tab yearpret1

  yearpret1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1987 |          1        5.26        5.26
       1988 |          1        5.26       10.53
       1990 |          1        5.26       15.79
       1992 |          2       10.53       26.32
       1993 |          3       15.79       42.11
       1995 |          2       10.53       52.63
       1996 |          5       26.32       78.95
       1998 |          1        5.26       84.21
       2000 |          1        5.26       89.47
       2003 |          1        5.26       94.74
       2004 |          1        5.26      100.00
------------+-----------------------------------
      Total |         19      100.00

. gen daypret1=day(datepret)
(491 missing values generated)

. tab daypret1

   daypret1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          6 |          3       15.79       15.79
         10 |          1        5.26       21.05
         12 |          1        5.26       26.32
         15 |         12       63.16       89.47
         22 |          1        5.26       94.74
         28 |          1        5.26      100.00
------------+-----------------------------------
      Total |         19      100.00

. gen monthpret1=month(datepret)
(491 missing values generated)

. tab monthpret1

 monthpret1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          1        5.26        5.26
          3 |          1        5.26       10.53
          6 |         16       84.21       94.74
          8 |          1        5.26      100.00
------------+-----------------------------------
      Total |         19      100.00

. list subjid datepret daypret1 monthpret1 yearpret1 in 1/10

     +-----------------------------------------------------+
     | subjid    datepret   daypret1   monthp~1   yearpr~1 |
     |-----------------------------------------------------|
  1. |  14581           .          .          .          . |
  2. | 463800           .          .          .          . |
  3. | 495428           .          .          .          . |
  4. | 624966           .          .          .          . |
  5. | 649440           .          .          .          . |
     |-----------------------------------------------------|
  6. | 651587           .          .          .          . |
  7. | 792656           .          .          .          . |
  8. | 794318   06jun2543          6          6       2000 |
  9. | 888840           .          .          .          . |
 10. | 906470           .          .          .          . |
     +-----------------------------------------------------+

. gen datepret1=mdy(monthpret1,daypret1,yearpret1)
(491 missing values generated)

. format datepret1 %d

. list subjid datepret daypret1 monthpret1 yearpret1 datepret1 in 1/10

     +-----------------------------------------------------------------+
     | subjid    datepret   daypret1   monthp~1   yearpr~1   datepret1 |
     |-----------------------------------------------------------------|
  1. |  14581           .          .          .          .           . |
  2. | 463800           .          .          .          .           . |
  3. | 495428           .          .          .          .           . |
  4. | 624966           .          .          .          .           . |
  5. | 649440           .          .          .          .           . |
     |-----------------------------------------------------------------|
  6. | 651587           .          .          .          .           . |
  7. | 792656           .          .          .          .           . |
  8. | 794318   06jun2543          6          6       2000   06jun2000 |
  9. | 888840           .          .          .          .           . |
 10. | 906470           .          .          .          .           . |
     +-----------------------------------------------------------------+

. drop daypret1 monthpret1 yearpret1 

. label var datepret1 "Date of Pre-transplantation"

. 
. tab year

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2543 |        354       69.41       69.41
       2547 |         51       10.00       79.41
       2548 |         44        8.63       88.04
       2549 |         61       11.96      100.00
------------+-----------------------------------
      Total |        510      100.00

. * 2543 to 2549 in Buddhist
. * will convert all to Gregorian
. gen year1=year

. replace year1= year-543 if inrange(year1,2030,.)
(510 real changes made)

. tab year1

      year1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2000 |        354       69.41       69.41
       2004 |         51       10.00       79.41
       2005 |         44        8.63       88.04
       2006 |         61       11.96      100.00
------------+-----------------------------------
      Total |        510      100.00

. list subjid year year1 in 1/10

     +-----------------------+
     | subjid   year   year1 |
     |-----------------------|
  1. |  14581   2543    2000 |
  2. | 463800   2543    2000 |
  3. | 495428   2543    2000 |
  4. | 624966   2543    2000 |
  5. | 649440   2543    2000 |
     |-----------------------|
  6. | 651587   2543    2000 |
  7. | 792656   2543    2000 |
  8. | 794318   2547    2004 |
  9. | 888840   2543    2000 |
 10. | 906470   2543    2000 |
     +-----------------------+

. 
. * Date of Operation
. list dateop in 1/10

     +-----------+
     |    dateop |
     |-----------|
  1. | 03aug2002 |
  2. | 05apr1997 |
  3. | 01may1999 |
  4. | 06aug1999 |
  5. | 07may1997 |
     |-----------|
  6. | 21aug1997 |
  7. | 23jul1997 |
  8. | 09aug2547 |
  9. | 19dec1997 |
 10. | 31oct1998 |
     +-----------+

. gen yearop1=year(dateop)

. tab yearop1

    yearop1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |          1        0.20        0.20
       1997 |         71       13.92       14.12
       1998 |         72       14.12       28.24
       1999 |         77       15.10       43.33
       2000 |         41        8.04       51.37
       2001 |         54       10.59       61.96
       2002 |         35        6.86       68.82
       2003 |          1        0.20       69.02
       2004 |          1        0.20       69.22
       2542 |          1        0.20       69.41
       2547 |         51       10.00       79.41
       2548 |         44        8.63       88.04
       2549 |         61       11.96      100.00
------------+-----------------------------------
      Total |        510      100.00

. * 1995 to 2004 in Gregorian
. * 2542 to 2549 in Buddhist
. * will convert all to Gregorian
. replace yearop1= yearop1-543 if inrange(yearop1,2030,.)
(157 real changes made)

. tab yearop1

    yearop1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |          1        0.20        0.20
       1997 |         71       13.92       14.12
       1998 |         72       14.12       28.24
       1999 |         78       15.29       43.53
       2000 |         41        8.04       51.57
       2001 |         54       10.59       62.16
       2002 |         35        6.86       69.02
       2003 |          1        0.20       69.22
       2004 |         52       10.20       79.41
       2005 |         44        8.63       88.04
       2006 |         61       11.96      100.00
------------+-----------------------------------
      Total |        510      100.00

. gen dayop1=day(dateop)

. tab dayop1

     dayop1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         10        1.96        1.96
          2 |         24        4.71        6.67
          3 |         16        3.14        9.80
          4 |         17        3.33       13.14
          5 |         11        2.16       15.29
          6 |         16        3.14       18.43
          7 |         23        4.51       22.94
          8 |         19        3.73       26.67
          9 |         26        5.10       31.76
         10 |         19        3.73       35.49
         11 |         14        2.75       38.24
         12 |         11        2.16       40.39
         13 |         12        2.35       42.75
         14 |         15        2.94       45.69
         15 |         16        3.14       48.82
         16 |         14        2.75       51.57
         17 |         17        3.33       54.90
         18 |         22        4.31       59.22
         19 |         21        4.12       63.33
         20 |         14        2.75       66.08
         21 |         20        3.92       70.00
         22 |         15        2.94       72.94
         23 |         18        3.53       76.47
         24 |         12        2.35       78.82
         25 |         14        2.75       81.57
         26 |         17        3.33       84.90
         27 |         14        2.75       87.65
         28 |         11        2.16       89.80
         29 |         22        4.31       94.12
         30 |         15        2.94       97.06
         31 |         15        2.94      100.00
------------+-----------------------------------
      Total |        510      100.00

. gen monthop1=month(dateop)

. tab monthop1

   monthop1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         44        8.63        8.63
          2 |         37        7.25       15.88
          3 |         52       10.20       26.08
          4 |         42        8.24       34.31
          5 |         51       10.00       44.31
          6 |         51       10.00       54.31
          7 |         44        8.63       62.94
          8 |         34        6.67       69.61
          9 |         37        7.25       76.86
         10 |         39        7.65       84.51
         11 |         40        7.84       92.35
         12 |         39        7.65      100.00
------------+-----------------------------------
      Total |        510      100.00

. list subjid dateop dayop1 monthop1 yearop1 in 1/10

     +--------------------------------------------------+
     | subjid      dateop   dayop1   monthop1   yearop1 |
     |--------------------------------------------------|
  1. |  14581   03aug2002        3          8      2002 |
  2. | 463800   05apr1997        5          4      1997 |
  3. | 495428   01may1999        1          5      1999 |
  4. | 624966   06aug1999        6          8      1999 |
  5. | 649440   07may1997        7          5      1997 |
     |--------------------------------------------------|
  6. | 651587   21aug1997       21          8      1997 |
  7. | 792656   23jul1997       23          7      1997 |
  8. | 794318   09aug2547        9          8      2004 |
  9. | 888840   19dec1997       19         12      1997 |
 10. | 906470   31oct1998       31         10      1998 |
     +--------------------------------------------------+

. gen dateop1=mdy(monthop1,dayop1,yearop1)

. format dateop1 %d

. list subjid dateop dayop1 monthop1 yearop1 dateop1 in 1/10

     +--------------------------------------------------------------+
     | subjid      dateop   dayop1   monthop1   yearop1     dateop1 |
     |--------------------------------------------------------------|
  1. |  14581   03aug2002        3          8      2002   03aug2002 |
  2. | 463800   05apr1997        5          4      1997   05apr1997 |
  3. | 495428   01may1999        1          5      1999   01may1999 |
  4. | 624966   06aug1999        6          8      1999   06aug1999 |
  5. | 649440   07may1997        7          5      1997   07may1997 |
     |--------------------------------------------------------------|
  6. | 651587   21aug1997       21          8      1997   21aug1997 |
  7. | 792656   23jul1997       23          7      1997   23jul1997 |
  8. | 794318   09aug2547        9          8      2004   09aug2004 |
  9. | 888840   19dec1997       19         12      1997   19dec1997 |
 10. | 906470   31oct1998       31         10      1998   31oct1998 |
     +--------------------------------------------------------------+

. drop dayop1 monthop1 yearop1 

. label var dateop1 "Date of Operation"

. 
. * Date of Best CR
. list datebcr in 1/10

     +-----------+
     |   datebcr |
     |-----------|
  1. | 03sep2002 |
  2. |         . |
  3. |         . |
  4. | 27sep1999 |
  5. | 17may2540 |
     |-----------|
  6. | 28aug1997 |
  7. | 04aug1997 |
  8. | 25aug2547 |
  9. |         . |
 10. |         . |
     +-----------+

. gen yearbcr1=year(datebcr)
(152 missing values generated)

. tab yearbcr1

   yearbcr1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |         22        6.15        6.15
       1998 |         26        7.26       13.41
       1999 |         31        8.66       22.07
       2000 |         35        9.78       31.84
       2001 |         46       12.85       44.69
       2002 |         36       10.06       54.75
       2003 |          1        0.28       55.03
       2540 |          4        1.12       56.15
       2541 |          1        0.28       56.42
       2542 |          2        0.56       56.98
       2543 |          1        0.28       57.26
       2547 |         49       13.69       70.95
       2548 |         44       12.29       83.24
       2549 |         57       15.92       99.16
       2550 |          3        0.84      100.00
------------+-----------------------------------
      Total |        358      100.00

. * 1997 to 2003 in Gregorian
. * 2540 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yearbcr1= yearbcr1-543 if inrange(yearbcr1,2030,.)
(161 real changes made)

. tab yearbcr1

   yearbcr1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |         26        7.26        7.26
       1998 |         27        7.54       14.80
       1999 |         33        9.22       24.02
       2000 |         36       10.06       34.08
       2001 |         46       12.85       46.93
       2002 |         36       10.06       56.98
       2003 |          1        0.28       57.26
       2004 |         49       13.69       70.95
       2005 |         44       12.29       83.24
       2006 |         57       15.92       99.16
       2007 |          3        0.84      100.00
------------+-----------------------------------
      Total |        358      100.00

. gen daybcr1=day(datebcr)
(152 missing values generated)

. tab daybcr1

    daybcr1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        2.23        2.23
          2 |         12        3.35        5.59
          3 |         16        4.47       10.06
          4 |          9        2.51       12.57
          5 |          7        1.96       14.53
          6 |         11        3.07       17.60
          7 |          4        1.12       18.72
          8 |         18        5.03       23.74
          9 |         17        4.75       28.49
         10 |          5        1.40       29.89
         11 |         14        3.91       33.80
         12 |          9        2.51       36.31
         13 |         12        3.35       39.66
         14 |         12        3.35       43.02
         15 |         16        4.47       47.49
         16 |         13        3.63       51.12
         17 |         18        5.03       56.15
         18 |         10        2.79       58.94
         19 |          7        1.96       60.89
         20 |         12        3.35       64.25
         21 |         15        4.19       68.44
         22 |         13        3.63       72.07
         23 |         13        3.63       75.70
         24 |         10        2.79       78.49
         25 |         12        3.35       81.84
         26 |         15        4.19       86.03
         27 |         12        3.35       89.39
         28 |         16        4.47       93.85
         29 |          8        2.23       96.09
         30 |         11        3.07       99.16
         31 |          3        0.84      100.00
------------+-----------------------------------
      Total |        358      100.00

. gen monthbcr1=month(datebcr)
(152 missing values generated)

. tab monthbcr1

  monthbcr1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         27        7.54        7.54
          2 |         37       10.34       17.88
          3 |         26        7.26       25.14
          4 |         29        8.10       33.24
          5 |         29        8.10       41.34
          6 |         38       10.61       51.96
          7 |         36       10.06       62.01
          8 |         25        6.98       68.99
          9 |         33        9.22       78.21
         10 |         27        7.54       85.75
         11 |         22        6.15       91.90
         12 |         29        8.10      100.00
------------+-----------------------------------
      Total |        358      100.00

. list subjid datebcr daybcr1 monthbcr1 yearbcr1 in 1/10

     +----------------------------------------------------+
     | subjid     datebcr   daybcr1   monthb~1   yearbcr1 |
     |----------------------------------------------------|
  1. |  14581   03sep2002         3          9       2002 |
  2. | 463800           .         .          .          . |
  3. | 495428           .         .          .          . |
  4. | 624966   27sep1999        27          9       1999 |
  5. | 649440   17may2540        17          5       1997 |
     |----------------------------------------------------|
  6. | 651587   28aug1997        28          8       1997 |
  7. | 792656   04aug1997         4          8       1997 |
  8. | 794318   25aug2547        25          8       2004 |
  9. | 888840           .         .          .          . |
 10. | 906470           .         .          .          . |
     +----------------------------------------------------+

. gen datebcr1=mdy(monthbcr1,daybcr1,yearbcr1)
(152 missing values generated)

. format datebcr1 %d

. list subjid datebcr daybcr1 monthbcr1 yearbcr1 datebcr1 in 1/10

     +----------------------------------------------------------------+
     | subjid     datebcr   daybcr1   monthb~1   yearbcr1    datebcr1 |
     |----------------------------------------------------------------|
  1. |  14581   03sep2002         3          9       2002   03sep2002 |
  2. | 463800           .         .          .          .           . |
  3. | 495428           .         .          .          .           . |
  4. | 624966   27sep1999        27          9       1999   27sep1999 |
  5. | 649440   17may2540        17          5       1997   17may1997 |
     |----------------------------------------------------------------|
  6. | 651587   28aug1997        28          8       1997   28aug1997 |
  7. | 792656   04aug1997         4          8       1997   04aug1997 |
  8. | 794318   25aug2547        25          8       2004   25aug2004 |
  9. | 888840           .         .          .          .           . |
 10. | 906470           .         .          .          .           . |
     +----------------------------------------------------------------+

. drop daybcr1 monthbcr1 yearbcr1 

. label var datebcr1 "Date of Best CR"

. 
. * Date of Discharge
. list datedis in 1/10

     +-----------+
     |   datedis |
     |-----------|
  1. | 11sep2002 |
  2. | 25apr1997 |
  3. | 20may1999 |
  4. | 03oct1999 |
  5. | 26may2540 |
     |-----------|
  6. | 25sep1997 |
  7. | 13aug1997 |
  8. | 25aug2547 |
  9. | 31dec1997 |
 10. | 17nov1998 |
     +-----------+

. gen yeardis1=year(datedis)
(5 missing values generated)

. tab yeardis1

   yeardis1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1990 |          1        0.20        0.20
       1995 |          1        0.20        0.40
       1997 |         63       12.48       12.87
       1998 |         68       13.47       26.34
       1999 |         77       15.25       41.58
       2000 |         44        8.71       50.30
       2001 |         52       10.30       60.59
       2002 |         37        7.33       67.92
       2003 |          1        0.20       68.12
       2540 |          4        0.79       68.91
       2542 |          3        0.59       69.50
       2543 |          1        0.20       69.70
       2547 |         48        9.50       79.21
       2548 |         42        8.32       87.52
       2549 |         59       11.68       99.21
       2550 |          4        0.79      100.00
------------+-----------------------------------
      Total |        505      100.00

. * 1990 to 2003 in Gregorian
. * 2540 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yeardis1= yeardis1-543 if inrange(yeardis1,2030,.)
(161 real changes made)

. tab yeardis1

   yeardis1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1990 |          1        0.20        0.20
       1995 |          1        0.20        0.40
       1997 |         67       13.27       13.66
       1998 |         68       13.47       27.13
       1999 |         80       15.84       42.97
       2000 |         45        8.91       51.88
       2001 |         52       10.30       62.18
       2002 |         37        7.33       69.50
       2003 |          1        0.20       69.70
       2004 |         48        9.50       79.21
       2005 |         42        8.32       87.52
       2006 |         59       11.68       99.21
       2007 |          4        0.79      100.00
------------+-----------------------------------
      Total |        505      100.00

. gen daydis1=day(datedis)
(5 missing values generated)

. tab daydis1

    daydis1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         13        2.57        2.57
          2 |         21        4.16        6.73
          3 |         17        3.37       10.10
          4 |         14        2.77       12.87
          5 |         19        3.76       16.63
          6 |         11        2.18       18.81
          7 |         15        2.97       21.78
          8 |         21        4.16       25.94
          9 |         17        3.37       29.31
         10 |         13        2.57       31.88
         11 |         21        4.16       36.04
         12 |         15        2.97       39.01
         13 |         22        4.36       43.37
         14 |         16        3.17       46.53
         15 |         15        2.97       49.50
         16 |         13        2.57       52.08
         17 |         17        3.37       55.45
         18 |         18        3.56       59.01
         19 |         10        1.98       60.99
         20 |         26        5.15       66.14
         21 |         17        3.37       69.50
         22 |         17        3.37       72.87
         23 |         21        4.16       77.03
         24 |         17        3.37       80.40
         25 |         21        4.16       84.55
         26 |         11        2.18       86.73
         27 |         19        3.76       90.50
         28 |         12        2.38       92.87
         29 |         13        2.57       95.45
         30 |         15        2.97       98.42
         31 |          8        1.58      100.00
------------+-----------------------------------
      Total |        505      100.00

. gen monthdis1=month(datedis)
(5 missing values generated)

. tab monthdis1

  monthdis1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         33        6.53        6.53
          2 |         44        8.71       15.25
          3 |         50        9.90       25.15
          4 |         44        8.71       33.86
          5 |         47        9.31       43.17
          6 |         44        8.71       51.88
          7 |         58       11.49       63.37
          8 |         29        5.74       69.11
          9 |         42        8.32       77.43
         10 |         34        6.73       84.16
         11 |         38        7.52       91.68
         12 |         42        8.32      100.00
------------+-----------------------------------
      Total |        505      100.00

. list subjid datedis daydis1 monthdis1 yeardis1 in 1/10

     +----------------------------------------------------+
     | subjid     datedis   daydis1   monthd~1   yeardis1 |
     |----------------------------------------------------|
  1. |  14581   11sep2002        11          9       2002 |
  2. | 463800   25apr1997        25          4       1997 |
  3. | 495428   20may1999        20          5       1999 |
  4. | 624966   03oct1999         3         10       1999 |
  5. | 649440   26may2540        26          5       1997 |
     |----------------------------------------------------|
  6. | 651587   25sep1997        25          9       1997 |
  7. | 792656   13aug1997        13          8       1997 |
  8. | 794318   25aug2547        25          8       2004 |
  9. | 888840   31dec1997        31         12       1997 |
 10. | 906470   17nov1998        17         11       1998 |
     +----------------------------------------------------+

. gen datedis1=mdy(monthdis1,daydis1,yeardis1)
(5 missing values generated)

. format datedis1 %d

. list subjid datedis daydis1 monthdis1 yeardis1 datedis1 in 1/10

     +----------------------------------------------------------------+
     | subjid     datedis   daydis1   monthd~1   yeardis1    datedis1 |
     |----------------------------------------------------------------|
  1. |  14581   11sep2002        11          9       2002   11sep2002 |
  2. | 463800   25apr1997        25          4       1997   25apr1997 |
  3. | 495428   20may1999        20          5       1999   20may1999 |
  4. | 624966   03oct1999         3         10       1999   03oct1999 |
  5. | 649440   26may2540        26          5       1997   26may1997 |
     |----------------------------------------------------------------|
  6. | 651587   25sep1997        25          9       1997   25sep1997 |
  7. | 792656   13aug1997        13          8       1997   13aug1997 |
  8. | 794318   25aug2547        25          8       2004   25aug2004 |
  9. | 888840   31dec1997        31         12       1997   31dec1997 |
 10. | 906470   17nov1998        17         11       1998   17nov1998 |
     +----------------------------------------------------------------+

. drop daydis1 monthdis1 yeardis1 

. label var datedis1 "Date of Discharge"

. 
. * Date of Acute Rejection
. list datear in 1/10

     +-----------+
     |    datear |
     |-----------|
  1. |         . |
  2. |         . |
  3. |         . |
  4. | 09aug1999 |
  5. |         . |
     |-----------|
  6. |         . |
  7. |         . |
  8. |         . |
  9. |         . |
 10. |         . |
     +-----------+

. gen yearar1=year(datear)
(467 missing values generated)

. tab yearar1

    yearar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          2        4.65        4.65
       1998 |         11       25.58       30.23
       1999 |          8       18.60       48.84
       2000 |          4        9.30       58.14
       2001 |          5       11.63       69.77
       2002 |          6       13.95       83.72
       2547 |          2        4.65       88.37
       2548 |          1        2.33       90.70
       2549 |          4        9.30      100.00
------------+-----------------------------------
      Total |         43      100.00

. * 1997 to 2002 in Gregorian
. * 2547 to 2549 in Buddhist
. * will convert all to Gregorian
. replace yearar1= yearar1-543 if inrange(yearar1,2030,.)
(7 real changes made)

. tab yearar1

    yearar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          2        4.65        4.65
       1998 |         11       25.58       30.23
       1999 |          8       18.60       48.84
       2000 |          4        9.30       58.14
       2001 |          5       11.63       69.77
       2002 |          6       13.95       83.72
       2004 |          2        4.65       88.37
       2005 |          1        2.33       90.70
       2006 |          4        9.30      100.00
------------+-----------------------------------
      Total |         43      100.00

. gen dayar1=day(datear)
(467 missing values generated)

. tab dayar1

     dayar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        4.65        4.65
          2 |          1        2.33        6.98
          3 |          4        9.30       16.28
          4 |          1        2.33       18.60
          6 |          2        4.65       23.26
          7 |          3        6.98       30.23
          9 |          5       11.63       41.86
         10 |          1        2.33       44.19
         12 |          2        4.65       48.84
         13 |          3        6.98       55.81
         15 |          2        4.65       60.47
         18 |          1        2.33       62.79
         19 |          1        2.33       65.12
         20 |          3        6.98       72.09
         21 |          1        2.33       74.42
         22 |          3        6.98       81.40
         23 |          2        4.65       86.05
         24 |          1        2.33       88.37
         25 |          1        2.33       90.70
         28 |          1        2.33       93.02
         29 |          2        4.65       97.67
         30 |          1        2.33      100.00
------------+-----------------------------------
      Total |         43      100.00

. gen monthar1=month(datear)
(467 missing values generated)

. tab monthar1

   monthar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        4.65        4.65
          2 |          1        2.33        6.98
          3 |          7       16.28       23.26
          4 |          5       11.63       34.88
          5 |          8       18.60       53.49
          6 |          2        4.65       58.14
          7 |          5       11.63       69.77
          8 |          3        6.98       76.74
         10 |          3        6.98       83.72
         11 |          3        6.98       90.70
         12 |          4        9.30      100.00
------------+-----------------------------------
      Total |         43      100.00

. list subjid datear dayar1 monthar1 yearar1 in 1/10

     +--------------------------------------------------+
     | subjid      datear   dayar1   monthar1   yearar1 |
     |--------------------------------------------------|
  1. |  14581           .        .          .         . |
  2. | 463800           .        .          .         . |
  3. | 495428           .        .          .         . |
  4. | 624966   09aug1999        9          8      1999 |
  5. | 649440           .        .          .         . |
     |--------------------------------------------------|
  6. | 651587           .        .          .         . |
  7. | 792656           .        .          .         . |
  8. | 794318           .        .          .         . |
  9. | 888840           .        .          .         . |
 10. | 906470           .        .          .         . |
     +--------------------------------------------------+

. gen datear1=mdy(monthar1,dayar1,yearar1)
(467 missing values generated)

. format datear1 %d

. list subjid datear dayar1 monthar1 yearar1 datear1 in 1/10

     +--------------------------------------------------------------+
     | subjid      datear   dayar1   monthar1   yearar1     datear1 |
     |--------------------------------------------------------------|
  1. |  14581           .        .          .         .           . |
  2. | 463800           .        .          .         .           . |
  3. | 495428           .        .          .         .           . |
  4. | 624966   09aug1999        9          8      1999   09aug1999 |
  5. | 649440           .        .          .         .           . |
     |--------------------------------------------------------------|
  6. | 651587           .        .          .         .           . |
  7. | 792656           .        .          .         .           . |
  8. | 794318           .        .          .         .           . |
  9. | 888840           .        .          .         .           . |
 10. | 906470           .        .          .         .           . |
     +--------------------------------------------------------------+

. drop dayar1 monthar1 yearar1 

. label var datear1 "Date of Acute Rejection"

. 
. * Date of UTI
. list dateuti in 1/10

     +-----------+
     |   dateuti |
     |-----------|
  1. |         . |
  2. | 10apr1997 |
  3. |         . |
  4. | 16aug1999 |
  5. |         . |
     |-----------|
  6. | 02sep1997 |
  7. |         . |
  8. | 16jul2547 |
  9. |         . |
 10. |         . |
     +-----------+

. gen yearuti1=year(dateuti)
(376 missing values generated)

. tab yearuti1

   yearuti1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |         12        8.96        8.96
       1998 |         12        8.96       17.91
       1999 |         14       10.45       28.36
       2000 |          4        2.99       31.34
       2001 |         15       11.19       42.54
       2002 |          7        5.22       47.76
       2542 |          1        0.75       48.51
       2547 |         25       18.66       67.16
       2548 |         11        8.21       75.37
       2549 |         31       23.13       98.51
       2550 |          2        1.49      100.00
------------+-----------------------------------
      Total |        134      100.00

. * 1997 to 2002 in Gregorian
. * 2542 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yearuti1= yearuti1-543 if inrange(yearuti1,2030,.)
(70 real changes made)

. tab yearuti1

   yearuti1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |         12        8.96        8.96
       1998 |         12        8.96       17.91
       1999 |         15       11.19       29.10
       2000 |          4        2.99       32.09
       2001 |         15       11.19       43.28
       2002 |          7        5.22       48.51
       2004 |         25       18.66       67.16
       2005 |         11        8.21       75.37
       2006 |         31       23.13       98.51
       2007 |          2        1.49      100.00
------------+-----------------------------------
      Total |        134      100.00

. gen dayuti1=day(dateuti)
(376 missing values generated)

. tab dayuti1

    dayuti1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          6        4.48        4.48
          2 |          7        5.22        9.70
          3 |          4        2.99       12.69
          4 |          6        4.48       17.16
          5 |          1        0.75       17.91
          6 |          5        3.73       21.64
          7 |          3        2.24       23.88
          8 |          4        2.99       26.87
          9 |          5        3.73       30.60
         10 |          5        3.73       34.33
         11 |          3        2.24       36.57
         12 |          2        1.49       38.06
         13 |          6        4.48       42.54
         14 |          3        2.24       44.78
         15 |          4        2.99       47.76
         16 |          4        2.99       50.75
         17 |          4        2.99       53.73
         18 |          3        2.24       55.97
         19 |          6        4.48       60.45
         20 |          6        4.48       64.93
         21 |          3        2.24       67.16
         22 |          3        2.24       69.40
         23 |          6        4.48       73.88
         24 |          4        2.99       76.87
         25 |          2        1.49       78.36
         26 |          4        2.99       81.34
         27 |          8        5.97       87.31
         28 |          3        2.24       89.55
         29 |          2        1.49       91.04
         30 |         10        7.46       98.51
         31 |          2        1.49      100.00
------------+-----------------------------------
      Total |        134      100.00

. gen monthuti1=month(dateuti)
(376 missing values generated)

. tab monthuti1

  monthuti1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         11        8.21        8.21
          2 |         13        9.70       17.91
          3 |          7        5.22       23.13
          4 |          8        5.97       29.10
          5 |         15       11.19       40.30
          6 |         13        9.70       50.00
          7 |         12        8.96       58.96
          8 |         14       10.45       69.40
          9 |         11        8.21       77.61
         10 |         11        8.21       85.82
         11 |         11        8.21       94.03
         12 |          8        5.97      100.00
------------+-----------------------------------
      Total |        134      100.00

. list subjid dateuti dayuti1 monthuti1 yearuti1 in 1/10

     +----------------------------------------------------+
     | subjid     dateuti   dayuti1   monthu~1   yearuti1 |
     |----------------------------------------------------|
  1. |  14581           .         .          .          . |
  2. | 463800   10apr1997        10          4       1997 |
  3. | 495428           .         .          .          . |
  4. | 624966   16aug1999        16          8       1999 |
  5. | 649440           .         .          .          . |
     |----------------------------------------------------|
  6. | 651587   02sep1997         2          9       1997 |
  7. | 792656           .         .          .          . |
  8. | 794318   16jul2547        16          7       2004 |
  9. | 888840           .         .          .          . |
 10. | 906470           .         .          .          . |
     +----------------------------------------------------+

. gen dateuti1=mdy(monthuti1,dayuti1,yearuti1)
(376 missing values generated)

. format dateuti1 %d

. list subjid dateuti dayuti1 monthuti1 yearuti1 dateuti1 in 1/10

     +----------------------------------------------------------------+
     | subjid     dateuti   dayuti1   monthu~1   yearuti1    dateuti1 |
     |----------------------------------------------------------------|
  1. |  14581           .         .          .          .           . |
  2. | 463800   10apr1997        10          4       1997   10apr1997 |
  3. | 495428           .         .          .          .           . |
  4. | 624966   16aug1999        16          8       1999   16aug1999 |
  5. | 649440           .         .          .          .           . |
     |----------------------------------------------------------------|
  6. | 651587   02sep1997         2          9       1997   02sep1997 |
  7. | 792656           .         .          .          .           . |
  8. | 794318   16jul2547        16          7       2004   16jul2004 |
  9. | 888840           .         .          .          .           . |
 10. | 906470           .         .          .          .           . |
     +----------------------------------------------------------------+

. drop dayuti1 monthuti1 yearuti1 

. label var dateuti1 "Date of UTI"

. 
. list subjid in 1/10

     +--------+
     | subjid |
     |--------|
  1. |  14581 |
  2. | 463800 |
  3. | 495428 |
  4. | 624966 |
  5. | 649440 |
     |--------|
  6. | 651587 |
  7. | 792656 |
  8. | 794318 |
  9. | 888840 |
 10. | 906470 |
     +--------+

. * for better indexing
. sort subjid

. list subjid in 1/10

     +--------+
     | subjid |
     |--------|
  1. |  14581 |
  2. | 463800 |
  3. | 495428 |
  4. | 624966 |
  5. | 649440 |
     |--------|
  6. | 651587 |
  7. | 792656 |
  8. | 794318 |
  9. | 888840 |
 10. | 906470 |
     +--------+

. save "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/cleaned enroll data for KT project.dta"
file /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/cleaned enroll data for KT project.dta saved

. clear

. 
. ***************************
. 
. * Follow Up Data
. 
. use "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/followup data for KT project.dta"
(recipient form)

. d

Contains data from /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/followup data for KT project.dta
  obs:         4,915                          recipient form
 vars:            62                          17 Feb 2020 09:59
-----------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------
subjid          long    %7.0f                 Subject ID
no              int     %3.0f                 ID
visit           float   %9.0g                 
datevisit       long    %d                    Date of visit
wt              double  %6.2f                 Weight
sbp             int     %3.0f                 SBP
dbp             int     %3.0f                 DBP
cr              double  %6.2f                 Creatinine
glu             double  %6.2f                 Glucose
chol            int     %3.0f                 Cholesterol
tg              int     %4.0f                 TG
sgot            int     %4.0f                 AST/SGOT
sgpt            int     %3.0f                 ALT/SGPT
proturia        byte    %11.0f     fol1       Proteinuria
uria24          double  %7.2f                 24 hr urine protein
hematur         byte    %11.0f     fol1       Hematuria
crclear         double  %6.2f                 Creatinine Clearance
csa             byte    %10.0f     fol2       Neoral(Cyclosporin)
csadose         double  %5.1f                 specify dose
pred            byte    %10.0f     fol2       Prednisolone
preddose        double  %5.1f                 specify dose
imuran          byte    %10.0f     fol2       Imuran(Azathioprine)
imudose         double  %5.1f                 specify dose
mmf             byte    %10.0f     fol2       Cellcept(MMF)
mmfdose         double  %6.1f                 specify dose
fk506           byte    %10.0f     fol2       Prograft(FK-506)
fkdose          double  %5.1f                 specify dose
rapar           byte    %10.0f     fol2       Raparmune
rapdose         double  %5.1f                 specify dose
csalevel        double  %6.1f                 CSA level
c2level         double  %6.1f                 C2 level
fklevel         double  %6.1f                 FK 506 level
cardil          byte    %10.0f     fol2       Diltiazem
keto            byte    %10.0f     fol2       Ketoconazole
acei            byte    %10.0f     fol2       ACEI
aiirb           byte    %10.0f     fol2       AIIRB
hmgcoa          byte    %10.0f     fol2       HMGCoA
dmdrug          byte    %10.0f     fol2       DM drug
otherht         byte    %10.0f     fol2       HT drug
spnum           byte    %2.0f                 specify number of HT
fibrate         byte    %10.0f     fol2       Fibrate drug
ar              byte    %10.0f     fol2       Acute rejection
bnaff           byte    %13.0f     fol3       Bnaff classification
datear          long    %d                    Date of Acute rejection
gf              byte    %16.0f     fol4       Graft outcome
dategf          long    %d                    Date of graft failue
causegf         byte    %30.0f     fol5       Cause of GF
othgf           str25   %25s                  specify other cause of GF
death           byte    %16.0f     fol6       Death outcome
datedie         long    %d                    Date of death
caused          byte    %32.0f     fol7       Cause of death
othdie          str25   %25s                  specify other cause of death
complica        byte    %10.0f     fol2       Complication
spcomp          byte    %22.0f     fol8       specify complication
othcomp         str31   %31s                  specify other complication
year            float   %9.0g                 
rapamun         double  %6.1f                 Rapamune level@
sbp1            float   %9.0g                 
dbp1            float   %9.0g                 
highchol        float   %14.0g     hchol      high cholesterol
diagdm          float   %9.0g      dm         DM diagnosis
hyper           float   %9.0g      dm         
-----------------------------------------------------------------------------------------------------------------------------
Sorted by: subjid

. * 4915 observations ( visits )
. 
. * Date of Visit
. list datevisit in 1/10

     +-----------+
     | datevisit |
     |-----------|
  1. | 19sep2545 |
  2. | 17oct2545 |
  3. | 14nov2545 |
  4. | 06feb2546 |
  5. | 03apr2546 |
     |-----------|
  6. | 17jul2546 |
  7. | 11dec2546 |
  8. | 07jul2548 |
  9. | 06may1997 |
 10. | 12jun1997 |
     +-----------+

. gen yearvisit1=year(datevisit)

. tab yearvisit1

 yearvisit1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |          4        0.08        0.08
       1996 |          5        0.10        0.18
       1997 |        195        3.97        4.15
       1998 |        349        7.10       11.25
       1999 |        559       11.37       22.62
       2000 |        527       10.72       33.35
       2001 |        438        8.91       42.26
       2002 |         54        1.10       43.36
       2003 |         49        1.00       44.35
       2005 |         34        0.69       45.05
       2006 |         30        0.61       45.66
       2540 |         63        1.28       46.94
       2541 |        152        3.09       50.03
       2542 |        211        4.29       54.32
       2543 |        260        5.29       59.61
       2544 |        352        7.16       66.78
       2545 |        578       11.76       78.54
       2546 |        426        8.67       87.20
       2547 |         12        0.24       87.45
       2548 |        315        6.41       93.86
       2549 |        291        5.92       99.78
       2550 |         11        0.22      100.00
------------+-----------------------------------
      Total |      4,915      100.00

. * 1995 to 2006 in Gregorian
. * 2540 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yearvisit1= yearvisit1-543 if inrange(yearvisit1,2030,.)
(2,671 real changes made)

. tab yearvisit1

 yearvisit1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1995 |          4        0.08        0.08
       1996 |          5        0.10        0.18
       1997 |        258        5.25        5.43
       1998 |        501       10.19       15.63
       1999 |        770       15.67       31.29
       2000 |        787       16.01       47.30
       2001 |        790       16.07       63.38
       2002 |        632       12.86       76.24
       2003 |        475        9.66       85.90
       2004 |         12        0.24       86.14
       2005 |        349        7.10       93.25
       2006 |        321        6.53       99.78
       2007 |         11        0.22      100.00
------------+-----------------------------------
      Total |      4,915      100.00

. gen dayvisit1=day(datevisit)

. tab dayvisit1

  dayvisit1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        145        2.95        2.95
          2 |        161        3.28        6.23
          3 |        165        3.36        9.58
          4 |        176        3.58       13.16
          5 |        149        3.03       16.20
          6 |        186        3.78       19.98
          7 |        215        4.37       24.35
          8 |        147        2.99       27.34
          9 |        184        3.74       31.09
         10 |        139        2.83       33.92
         11 |        195        3.97       37.88
         12 |        153        3.11       41.00
         13 |        154        3.13       44.13
         14 |        181        3.68       47.81
         15 |        114        2.32       50.13
         16 |        188        3.83       53.96
         17 |        145        2.95       56.91
         18 |        157        3.19       60.10
         19 |        161        3.28       63.38
         20 |        187        3.80       67.18
         21 |        134        2.73       69.91
         22 |        151        3.07       72.98
         23 |        162        3.30       76.28
         24 |        177        3.60       79.88
         25 |        177        3.60       83.48
         26 |        142        2.89       86.37
         27 |        181        3.68       90.05
         28 |        139        2.83       92.88
         29 |        100        2.03       94.91
         30 |        185        3.76       98.68
         31 |         65        1.32      100.00
------------+-----------------------------------
      Total |      4,915      100.00

. gen monthvisit1=month(datevisit)

. tab monthvisit1

monthvisit1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        338        6.88        6.88
          2 |        312        6.35       13.22
          3 |        357        7.26       20.49
          4 |        307        6.25       26.73
          5 |        393        8.00       34.73
          6 |        557       11.33       46.06
          7 |        489        9.95       56.01
          8 |        383        7.79       63.80
          9 |        368        7.49       71.29
         10 |        409        8.32       79.61
         11 |        510       10.38       89.99
         12 |        492       10.01      100.00
------------+-----------------------------------
      Total |      4,915      100.00

. list subjid datevisit dayvisit1 monthvisit1 yearvisit1 in 1/10

     +-----------------------------------------------------+
     | subjid   datevisit   dayvis~1   monthv~1   yearvi~1 |
     |-----------------------------------------------------|
  1. |  14581   19sep2545         19          9       2002 |
  2. |  14581   17oct2545         17         10       2002 |
  3. |  14581   14nov2545         14         11       2002 |
  4. |  14581   06feb2546          6          2       2003 |
  5. |  14581   03apr2546          3          4       2003 |
     |-----------------------------------------------------|
  6. |  14581   17jul2546         17          7       2003 |
  7. |  14581   11dec2546         11         12       2003 |
  8. |  14581   07jul2548          7          7       2005 |
  9. | 463800   06may1997          6          5       1997 |
 10. | 463800   12jun1997         12          6       1997 |
     +-----------------------------------------------------+

. gen datevisit1=mdy(monthvisit1,dayvisit1,yearvisit1)

. format datevisit1 %d

. list subjid datevisit dayvisit1 monthvisit1 yearvisit1 datevisit1 in 1/10

     +-----------------------------------------------------------------+
     | subjid   datevisit   dayvis~1   monthv~1   yearvi~1   datevis~1 |
     |-----------------------------------------------------------------|
  1. |  14581   19sep2545         19          9       2002   19sep2002 |
  2. |  14581   17oct2545         17         10       2002   17oct2002 |
  3. |  14581   14nov2545         14         11       2002   14nov2002 |
  4. |  14581   06feb2546          6          2       2003   06feb2003 |
  5. |  14581   03apr2546          3          4       2003   03apr2003 |
     |-----------------------------------------------------------------|
  6. |  14581   17jul2546         17          7       2003   17jul2003 |
  7. |  14581   11dec2546         11         12       2003   11dec2003 |
  8. |  14581   07jul2548          7          7       2005   07jul2005 |
  9. | 463800   06may1997          6          5       1997   06may1997 |
 10. | 463800   12jun1997         12          6       1997   12jun1997 |
     +-----------------------------------------------------------------+

. drop dayvisit1 monthvisit1 yearvisit1  

. label var datevisit1 "Date of Visit"

. 
. tab year

       year |      Freq.     Percent        Cum.
------------+-----------------------------------
       2543 |      4,697       95.56       95.56
       2547 |         87        1.77       97.33
       2548 |         72        1.46       98.80
       2549 |         59        1.20      100.00
------------+-----------------------------------
      Total |      4,915      100.00

. * 2543 to 2549 in Buddhist
. * will convert all to Gregorian
. gen year2=year

. replace year2= year-543 if inrange(year2,2030,.)
(4,915 real changes made)

. tab year2

      year2 |      Freq.     Percent        Cum.
------------+-----------------------------------
       2000 |      4,697       95.56       95.56
       2004 |         87        1.77       97.33
       2005 |         72        1.46       98.80
       2006 |         59        1.20      100.00
------------+-----------------------------------
      Total |      4,915      100.00

. list subjid year year2 in 1/10

     +-----------------------+
     | subjid   year   year2 |
     |-----------------------|
  1. |  14581   2543    2000 |
  2. |  14581   2543    2000 |
  3. |  14581   2543    2000 |
  4. |  14581   2543    2000 |
  5. |  14581   2543    2000 |
     |-----------------------|
  6. |  14581   2543    2000 |
  7. |  14581   2543    2000 |
  8. |  14581   2543    2000 |
  9. | 463800   2543    2000 |
 10. | 463800   2543    2000 |
     +-----------------------+

. 
. * Date of Acute Rejection
. list datear in 1/10

     +--------+
     | datear |
     |--------|
  1. |      . |
  2. |      . |
  3. |      . |
  4. |      . |
  5. |      . |
     |--------|
  6. |      . |
  7. |      . |
  8. |      . |
  9. |      . |
 10. |      . |
     +--------+

. gen yearar1=year(datear)
(4,818 missing values generated)

. tab yearar1

    yearar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |          6        6.19        6.19
       1998 |         11       11.34       17.53
       1999 |          5        5.15       22.68
       2000 |          3        3.09       25.77
       2001 |          4        4.12       29.90
       2003 |          2        2.06       31.96
       2540 |          7        7.22       39.18
       2541 |          9        9.28       48.45
       2542 |          8        8.25       56.70
       2543 |          6        6.19       62.89
       2544 |         13       13.40       76.29
       2545 |         16       16.49       92.78
       2546 |          4        4.12       96.91
       2548 |          1        1.03       97.94
       2549 |          1        1.03       98.97
       2550 |          1        1.03      100.00
------------+-----------------------------------
      Total |         97      100.00

. * 1997 to 2003 in Gregorian
. * 2540 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yearar1= yearar1-543 if inrange(yearar1,2030,.)
(66 real changes made)

. tab yearar1

    yearar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1997 |         13       13.40       13.40
       1998 |         20       20.62       34.02
       1999 |         13       13.40       47.42
       2000 |          9        9.28       56.70
       2001 |         17       17.53       74.23
       2002 |         16       16.49       90.72
       2003 |          6        6.19       96.91
       2005 |          1        1.03       97.94
       2006 |          1        1.03       98.97
       2007 |          1        1.03      100.00
------------+-----------------------------------
      Total |         97      100.00

. gen dayar1=day(datear)
(4,818 missing values generated)

. tab dayar1

     dayar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          4        4.12        4.12
          2 |          4        4.12        8.25
          3 |          5        5.15       13.40
          4 |          4        4.12       17.53
          5 |          2        2.06       19.59
          6 |          6        6.19       25.77
          7 |          7        7.22       32.99
          8 |          1        1.03       34.02
          9 |          3        3.09       37.11
         11 |          2        2.06       39.18
         12 |          4        4.12       43.30
         13 |          3        3.09       46.39
         14 |          5        5.15       51.55
         15 |          1        1.03       52.58
         16 |          2        2.06       54.64
         17 |          6        6.19       60.82
         18 |          1        1.03       61.86
         19 |          4        4.12       65.98
         20 |          3        3.09       69.07
         21 |          4        4.12       73.20
         22 |          6        6.19       79.38
         23 |          2        2.06       81.44
         24 |          6        6.19       87.63
         25 |          2        2.06       89.69
         26 |          1        1.03       90.72
         27 |          1        1.03       91.75
         28 |          1        1.03       92.78
         29 |          2        2.06       94.85
         30 |          4        4.12       98.97
         31 |          1        1.03      100.00
------------+-----------------------------------
      Total |         97      100.00

. gen monthar1=month(datear)
(4,818 missing values generated)

. tab monthar1

   monthar1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          8        8.25        8.25
          2 |          7        7.22       15.46
          3 |          9        9.28       24.74
          4 |          9        9.28       34.02
          5 |         10       10.31       44.33
          6 |         11       11.34       55.67
          7 |          8        8.25       63.92
          8 |          6        6.19       70.10
          9 |          3        3.09       73.20
         10 |          5        5.15       78.35
         11 |         10       10.31       88.66
         12 |         11       11.34      100.00
------------+-----------------------------------
      Total |         97      100.00

. list subjid datear dayar1 monthar1 yearar1 in 1/10

     +-----------------------------------------------+
     | subjid   datear   dayar1   monthar1   yearar1 |
     |-----------------------------------------------|
  1. |  14581        .        .          .         . |
  2. |  14581        .        .          .         . |
  3. |  14581        .        .          .         . |
  4. |  14581        .        .          .         . |
  5. |  14581        .        .          .         . |
     |-----------------------------------------------|
  6. |  14581        .        .          .         . |
  7. |  14581        .        .          .         . |
  8. |  14581        .        .          .         . |
  9. | 463800        .        .          .         . |
 10. | 463800        .        .          .         . |
     +-----------------------------------------------+

. gen datear1=mdy(monthar1,dayar1,yearar1)
(4,818 missing values generated)

. format datear1 %d

. list subjid datear dayar1 monthar1 yearar1 datear1 in 1/10

     +---------------------------------------------------------+
     | subjid   datear   dayar1   monthar1   yearar1   datear1 |
     |---------------------------------------------------------|
  1. |  14581        .        .          .         .         . |
  2. |  14581        .        .          .         .         . |
  3. |  14581        .        .          .         .         . |
  4. |  14581        .        .          .         .         . |
  5. |  14581        .        .          .         .         . |
     |---------------------------------------------------------|
  6. |  14581        .        .          .         .         . |
  7. |  14581        .        .          .         .         . |
  8. |  14581        .        .          .         .         . |
  9. | 463800        .        .          .         .         . |
 10. | 463800        .        .          .         .         . |
     +---------------------------------------------------------+

. drop dayar1 monthar1 yearar1  

. label var datear1 "Date of Best CR"

. 
. * Date of Graft Failure
. list dategf in 1/10

     +--------+
     | dategf |
     |--------|
  1. |      . |
  2. |      . |
  3. |      . |
  4. |      . |
  5. |      . |
     |--------|
  6. |      . |
  7. |      . |
  8. |      . |
  9. |      . |
 10. |      . |
     +--------+

. gen yeargf1=year(dategf)
(4,816 missing values generated)

. tab yeargf1

    yeargf1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1998 |          6        6.06        6.06
       1999 |          5        5.05       11.11
       2000 |          8        8.08       19.19
       2005 |          3        3.03       22.22
       2541 |          2        2.02       24.24
       2542 |          5        5.05       29.29
       2543 |          7        7.07       36.36
       2544 |          8        8.08       44.44
       2545 |          6        6.06       50.51
       2546 |         17       17.17       67.68
       2547 |          9        9.09       76.77
       2548 |         14       14.14       90.91
       2549 |          8        8.08       98.99
       2550 |          1        1.01      100.00
------------+-----------------------------------
      Total |         99      100.00

. * 1998 to 2005 in Gregorian
. * 2541 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yeargf1= yeargf1-543 if inrange(yeargf1,2030,.)
(77 real changes made)

. tab yeargf1

    yeargf1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1998 |          8        8.08        8.08
       1999 |         10       10.10       18.18
       2000 |         15       15.15       33.33
       2001 |          8        8.08       41.41
       2002 |          6        6.06       47.47
       2003 |         17       17.17       64.65
       2004 |          9        9.09       73.74
       2005 |         17       17.17       90.91
       2006 |          8        8.08       98.99
       2007 |          1        1.01      100.00
------------+-----------------------------------
      Total |         99      100.00

. gen daygf1=day(dategf)
(4,816 missing values generated)

. tab daygf1

     daygf1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        1.01        1.01
          2 |          5        5.05        6.06
          3 |          1        1.01        7.07
          5 |          8        8.08       15.15
          6 |          1        1.01       16.16
          7 |          2        2.02       18.18
          9 |          1        1.01       19.19
         10 |          3        3.03       22.22
         12 |          4        4.04       26.26
         13 |          3        3.03       29.29
         14 |          6        6.06       35.35
         15 |          8        8.08       43.43
         16 |          3        3.03       46.46
         17 |          1        1.01       47.47
         18 |          3        3.03       50.51
         19 |          4        4.04       54.55
         20 |         10       10.10       64.65
         21 |          2        2.02       66.67
         22 |          3        3.03       69.70
         23 |          5        5.05       74.75
         25 |          7        7.07       81.82
         26 |          1        1.01       82.83
         27 |          4        4.04       86.87
         28 |          3        3.03       89.90
         29 |          2        2.02       91.92
         30 |          8        8.08      100.00
------------+-----------------------------------
      Total |         99      100.00

. gen monthgf1=month(dategf)
(4,816 missing values generated)

. tab monthgf1

   monthgf1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          5        5.05        5.05
          2 |         11       11.11       16.16
          3 |         11       11.11       27.27
          4 |          8        8.08       35.35
          5 |         12       12.12       47.47
          6 |          9        9.09       56.57
          7 |         10       10.10       66.67
          8 |         12       12.12       78.79
          9 |          5        5.05       83.84
         10 |          5        5.05       88.89
         11 |          4        4.04       92.93
         12 |          7        7.07      100.00
------------+-----------------------------------
      Total |         99      100.00

. list subjid dategf daygf1 monthgf1 yeargf1 in 1/10

     +-----------------------------------------------+
     | subjid   dategf   daygf1   monthgf1   yeargf1 |
     |-----------------------------------------------|
  1. |  14581        .        .          .         . |
  2. |  14581        .        .          .         . |
  3. |  14581        .        .          .         . |
  4. |  14581        .        .          .         . |
  5. |  14581        .        .          .         . |
     |-----------------------------------------------|
  6. |  14581        .        .          .         . |
  7. |  14581        .        .          .         . |
  8. |  14581        .        .          .         . |
  9. | 463800        .        .          .         . |
 10. | 463800        .        .          .         . |
     +-----------------------------------------------+

. gen dategf1=mdy(monthgf1,daygf1,yeargf1)
(4,816 missing values generated)

. format dategf1 %d

. list subjid dategf daygf1 monthgf1 yeargf1 dategf1 in 1/10

     +---------------------------------------------------------+
     | subjid   dategf   daygf1   monthgf1   yeargf1   dategf1 |
     |---------------------------------------------------------|
  1. |  14581        .        .          .         .         . |
  2. |  14581        .        .          .         .         . |
  3. |  14581        .        .          .         .         . |
  4. |  14581        .        .          .         .         . |
  5. |  14581        .        .          .         .         . |
     |---------------------------------------------------------|
  6. |  14581        .        .          .         .         . |
  7. |  14581        .        .          .         .         . |
  8. |  14581        .        .          .         .         . |
  9. | 463800        .        .          .         .         . |
 10. | 463800        .        .          .         .         . |
     +---------------------------------------------------------+

. drop daygf1 monthgf1 yeargf1 

. label var dategf1 "Date of Graft Failure"

. 
. * Date of Death
. list datedie in 1/10

     +---------+
     | datedie |
     |---------|
  1. |       . |
  2. |       . |
  3. |       . |
  4. |       . |
  5. |       . |
     |---------|
  6. |       . |
  7. |       . |
  8. |       . |
  9. |       . |
 10. |       . |
     +---------+

. gen yeardie1=year(datedie)
(4,890 missing values generated)

. tab yeardie1

   yeardie1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1999 |          3       12.00       12.00
       2000 |          4       16.00       28.00
       2001 |          1        4.00       32.00
       2541 |          1        4.00       36.00
       2542 |          1        4.00       40.00
       2543 |          2        8.00       48.00
       2544 |          1        4.00       52.00
       2545 |          2        8.00       60.00
       2546 |          2        8.00       68.00
       2547 |          3       12.00       80.00
       2548 |          5       20.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. * 1998 to 2005 in Gregorian
. * 2541 to 2550 in Buddhist
. * will convert all to Gregorian
. replace yeardie1= yeardie1-543 if inrange(yeardie1,2030,.)
(17 real changes made)

. tab yeardie1

   yeardie1 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1998 |          1        4.00        4.00
       1999 |          4       16.00       20.00
       2000 |          6       24.00       44.00
       2001 |          2        8.00       52.00
       2002 |          2        8.00       60.00
       2003 |          2        8.00       68.00
       2004 |          3       12.00       80.00
       2005 |          5       20.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. gen daydie1=day(datedie)
(4,890 missing values generated)

. tab daydie1

    daydie1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          2 |          3       12.00       12.00
          5 |          1        4.00       16.00
         10 |          1        4.00       20.00
         11 |          1        4.00       24.00
         13 |          3       12.00       36.00
         14 |          1        4.00       40.00
         16 |          1        4.00       44.00
         18 |          1        4.00       48.00
         19 |          2        8.00       56.00
         20 |          1        4.00       60.00
         21 |          2        8.00       68.00
         23 |          2        8.00       76.00
         24 |          2        8.00       84.00
         28 |          2        8.00       92.00
         29 |          1        4.00       96.00
         30 |          1        4.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. gen monthdie1=month(datedie)
(4,890 missing values generated)

. tab monthdie1

  monthdie1 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1        4.00        4.00
          2 |          2        8.00       12.00
          3 |          1        4.00       16.00
          4 |          6       24.00       40.00
          5 |          3       12.00       52.00
          6 |          1        4.00       56.00
          7 |          3       12.00       68.00
          8 |          1        4.00       72.00
         10 |          3       12.00       84.00
         11 |          1        4.00       88.00
         12 |          3       12.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. list subjid datedie daydie1 monthdie1 yeardie1 in 1/10

     +--------------------------------------------------+
     | subjid   datedie   daydie1   monthd~1   yeardie1 |
     |--------------------------------------------------|
  1. |  14581         .         .          .          . |
  2. |  14581         .         .          .          . |
  3. |  14581         .         .          .          . |
  4. |  14581         .         .          .          . |
  5. |  14581         .         .          .          . |
     |--------------------------------------------------|
  6. |  14581         .         .          .          . |
  7. |  14581         .         .          .          . |
  8. |  14581         .         .          .          . |
  9. | 463800         .         .          .          . |
 10. | 463800         .         .          .          . |
     +--------------------------------------------------+

. gen datedie1=mdy(monthdie1,daydie1,yeardie1)
(4,890 missing values generated)

. format datedie1 %d

. list subjid datedie daydie1 monthdie1 yeardie1 datedie1 in 1/10

     +-------------------------------------------------------------+
     | subjid   datedie   daydie1   monthd~1   yeardie1   datedie1 |
     |-------------------------------------------------------------|
  1. |  14581         .         .          .          .          . |
  2. |  14581         .         .          .          .          . |
  3. |  14581         .         .          .          .          . |
  4. |  14581         .         .          .          .          . |
  5. |  14581         .         .          .          .          . |
     |-------------------------------------------------------------|
  6. |  14581         .         .          .          .          . |
  7. |  14581         .         .          .          .          . |
  8. |  14581         .         .          .          .          . |
  9. | 463800         .         .          .          .          . |
 10. | 463800         .         .          .          .          . |
     +-------------------------------------------------------------+

. drop daydie1 monthdie1 yeardie1  

. label var datedie1 "Date of Death"

. 
. * for better indexing
. sort subjid datevisit1

. list subjid datevisit1 gf in 1/20

     +----------------------------------+
     | subjid   datevis~1            gf |
     |----------------------------------|
  1. |  14581   19sep2002   1. function |
  2. |  14581   17oct2002   1. function |
  3. |  14581   14nov2002   1. function |
  4. |  14581   06feb2003   1. function |
  5. |  14581   03apr2003   1. function |
     |----------------------------------|
  6. |  14581   17jul2003   1. function |
  7. |  14581   11dec2003   1. function |
  8. |  14581   07jul2005   1. function |
  9. | 463800   06may1997   1. function |
 10. | 463800   12jun1997   1. function |
     |----------------------------------|
 11. | 463800   24jul1997   1. function |
 12. | 463800   14aug1997   1. function |
 13. | 463800   09oct1997   1. function |
 14. | 463800   05nov1997   1. function |
 15. | 463800   08jan1998   1. function |
     |----------------------------------|
 16. | 463800   02apr1998   1. function |
 17. | 463800   25jun1998   1. function |
 18. | 463800   15oct1998   1. function |
 19. | 463800   07jan1999   1. function |
 20. | 463800   27may1999   1. function |
     +----------------------------------+

. tab gf

   Graft outcome |      Freq.     Percent        Cum.
-----------------+-----------------------------------
     1. function |      4,788       97.42       97.42
2. graft failure |         99        2.01       99.43
3. loss followup |         28        0.57      100.00
-----------------+-----------------------------------
           Total |      4,915      100.00

. save "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/cleaned follow up data for KT project.dta"
file /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/cleaned follow up data for KT project.dta saved

. clear

. 
. ***************************
. 
. use "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/cleaned enroll data for KT project.dta"
(recipient form)

. merge 1:m subjid using  "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/cleaned follow up data for KT pro
> ject.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            10
        from master                        10  (_merge==1)
        from using                          0  (_merge==2)

    matched                             4,915  (_merge==3)
    -----------------------------------------

. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
        master only (1) |         10        0.20        0.20
            matched (3) |      4,915       99.80      100.00
------------------------+-----------------------------------
                  Total |      4,925      100.00

. 
. list no subjid if _merge==1

      +---------------+
      |  no    subjid |
      |---------------|
  22. | 151   1804688 |
  46. | 165   2223194 |
  93. | 121   2593548 |
 107. |  25   2689017 |
 138. | 153   2796553 |
      |---------------|
 170. |  40   2872803 |
 323. | 358   3227209 |
 355. |  90   3307933 |
 447. |  47   3727186 |
 510. |  60   4008529 |
      +---------------+

. * 10 subjects enrolled but not followed up
. * will be dropped here
. 
. keep if _merge==3
(10 observations deleted)

. tab _merge

                 _merge |      Freq.     Percent        Cum.
------------------------+-----------------------------------
            matched (3) |      4,915      100.00      100.00
------------------------+-----------------------------------
                  Total |      4,915      100.00

. * final sample size is 4915 observations ( visits ) from 500 subjects
. save "/Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/merged data for KT project.dta"
file /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/merged data for KT project.dta saved

. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/hteza/Desktop/Class/RACE626/Assignment_2_SA/Assignment II/data_preprocessing.log
  log type:  text
 closed on:  10 Mar 2020, 11:38:23
-----------------------------------------------------------------------------------------------------------------------------
